Revit 2024 API
ParameterTypeId.WitnsLineExtension Property
 "Witness Line Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WitnsLineExtension { get; }
Visual Basic
Public Shared ReadOnly Property WitnsLineExtension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WitnsLineExtension {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace